limit = [1, 2, 1, 4]
dog = [{
    "이름" : "루비독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "4",
    },{
    "이름" : "피치독",
    "나이" : "95년생",
    "점프력" : "3",
    "몸무게" : "3",
    },{
    "이름" : "씨-독",
    "나이" : "72년생",
    "점프력" : "2",
    "몸무게" : "1",
    },{
    "이름" : "코볼독",
    "나이" : "59년생",
    "점프력" : "1",
    "몸무게" : "1",
    },
]

# limit = [5, 3, 4, 1, 3, 8, 3]
# dog = [{
#     "이름" : "루비독",
#     "나이" : "95년생",
#     "점프력" : "3",
#     "몸무게" : "4",
#     },{
#     "이름" : "피치독",
#     "나이" : "95년생",
#     "점프력" : "3",
#     "몸무게" : "3",
#     },{
#     "이름" : "씨-독",
#     "나이" : "72년생",
#     "점프력" : "2",
#     "몸무게" : "1",
#     },{
#     "이름" : "코볼독",
#     "나이" : "59년생",
#     "점프력" : "1",
#     "몸무게" : "1",
#     },
# ]

ans = [i["이름"] for i in dog]
for i in dog:
    h = 1
    jump = int(i["점프력"])
    weight = int(i["몸무게"])
    while jump*h-1 < len(limit):
        limit[jump*h-1] -= weight
        if limit[jump*h-1]< 0:
            del ans[ans.index(i["이름"])]
            break
        h += 1
print(ans)
